JorgeGzm/zephyr/include/zephyr/dt-bindings/clock/gd32vw55x-clocks.h
/*
 * Copyright (c) 2026 Jorge Guzman
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_GD32VW55X_CLOCKS_H_
#define ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_GD32VW55X_CLOCKS_H_

#include "gd32-clocks-common.h"

/**
 * @name Register offsets
 * @{
 */

#define GD32_AHB1EN_OFFSET 0x30U
#define GD32_AHB2EN_OFFSET 0x34U
#define GD32_AHB3EN_OFFSET 0x38U
#define GD32_APB1EN_OFFSET 0x40U
#define GD32_APB2EN_OFFSET 0x44U

/** @} */

/**
 * @name Clock enable/disable definitions for peripherals
 * @{
 */

/* AHB1 peripherals */
#define GD32_CLOCK_GPIOA   GD32_CLOCK_CONFIG(AHB1EN, 0U)
#define GD32_CLOCK_GPIOB   GD32_CLOCK_CONFIG(AHB1EN, 1U)
#define GD32_CLOCK_GPIOC   GD32_CLOCK_CONFIG(AHB1EN, 2U)
#define GD32_CLOCK_CRC     GD32_CLOCK_CONFIG(AHB1EN, 12U)
#define GD32_CLOCK_WIFI    GD32_CLOCK_CONFIG(AHB1EN, 13U)
#define GD32_CLOCK_WIFIRUN GD32_CLOCK_CONFIG(AHB1EN, 14U)
#define GD32_CLOCK_SRAM0   GD32_CLOCK_CONFIG(AHB1EN, 16U)
#define GD32_CLOCK_SRAM1   GD32_CLOCK_CONFIG(AHB1EN, 17U)
#define GD32_CLOCK_SRAM2   GD32_CLOCK_CONFIG(AHB1EN, 18U)
#define GD32_CLOCK_SRAM3   GD32_CLOCK_CONFIG(AHB1EN, 19U)
#define GD32_CLOCK_DMA     GD32_CLOCK_CONFIG(AHB1EN, 21U)
#define GD32_CLOCK_BLE     GD32_CLOCK_CONFIG(AHB1EN, 31U)

/* AHB2 peripherals */
#define GD32_CLOCK_PKCAU GD32_CLOCK_CONFIG(AHB2EN, 3U)
#define GD32_CLOCK_CAU   GD32_CLOCK_CONFIG(AHB2EN, 4U)
#define GD32_CLOCK_HAU   GD32_CLOCK_CONFIG(AHB2EN, 5U)
#define GD32_CLOCK_TRNG  GD32_CLOCK_CONFIG(AHB2EN, 6U)

/* AHB3 peripherals */
#define GD32_CLOCK_QSPI GD32_CLOCK_CONFIG(AHB3EN, 1U)

/* APB1 peripherals */
#define GD32_CLOCK_TIMER1 GD32_CLOCK_CONFIG(APB1EN, 0U)
#define GD32_CLOCK_TIMER2 GD32_CLOCK_CONFIG(APB1EN, 1U)
#define GD32_CLOCK_TIMER5 GD32_CLOCK_CONFIG(APB1EN, 4U)
#define GD32_CLOCK_WWDGT  GD32_CLOCK_CONFIG(APB1EN, 11U)
#define GD32_CLOCK_RFI    GD32_CLOCK_CONFIG(APB1EN, 15U)
#define GD32_CLOCK_UART1  GD32_CLOCK_CONFIG(APB1EN, 17U)
#define GD32_CLOCK_USART0 GD32_CLOCK_CONFIG(APB1EN, 18U)
#define GD32_CLOCK_I2C0   GD32_CLOCK_CONFIG(APB1EN, 21U)
#define GD32_CLOCK_I2C1   GD32_CLOCK_CONFIG(APB1EN, 22U)
#define GD32_CLOCK_PMU    GD32_CLOCK_CONFIG(APB1EN, 28U)

/* APB2 peripherals */
#define GD32_CLOCK_TIMER0  GD32_CLOCK_CONFIG(APB2EN, 0U)
#define GD32_CLOCK_UART2   GD32_CLOCK_CONFIG(APB2EN, 4U)
#define GD32_CLOCK_ADC     GD32_CLOCK_CONFIG(APB2EN, 8U)
#define GD32_CLOCK_SPI     GD32_CLOCK_CONFIG(APB2EN, 12U)
#define GD32_CLOCK_SYSCFG  GD32_CLOCK_CONFIG(APB2EN, 14U)
#define GD32_CLOCK_TIMER15 GD32_CLOCK_CONFIG(APB2EN, 17U)
#define GD32_CLOCK_TIMER16 GD32_CLOCK_CONFIG(APB2EN, 18U)
#define GD32_CLOCK_RF      GD32_CLOCK_CONFIG(APB2EN, 31U)

/** @} */

#endif /* ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_GD32VW55X_CLOCKS_H_ */
